// src/components/WhyTrust.tsx
const WhyTrust = () => {
  return (
    <div className="border-2 border-green-950 my-16 mx-2 md:mx-[20%] px-2 pt-4 md:p-12 rounded-3xl">
      <div className="relative flex flex-col items-center">
        <button className="font-bold bg-green-400 text-blueTextColor rounded-full text-lg md:text-2xl py-3 md:py-4 px-4 md:px-6 flex items-center justify-center gap-2">
          কেন আমাদেরকে (Restart Yourself) ভরসা করবেন!
        </button>
        <svg
          className="absolute left-1/2 transform -translate-x-1/2 top-full mt-2" // Centered under the button
          width="200"
          height="20"
          viewBox="0 0 200 20"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M0 10 Q10 0 20 10 T40 10 T60 10 T80 10 T100 10 T120 10 T140 10 T160 10 T180 10 T200 10"
            stroke="#34D399"
            strokeWidth="4"
            fill="transparent"
            className="animate-draw"
          />
        </svg>
      </div>
      <div className="mt-8 leading-loose *:mb-5">
        <p>
          আমরা আসলে শুধু একটা ‘ওয়ার্কবুক’ সেল করছি না। আমরা আপনার প্রতিদিন
          সুন্দর করতে চাই। আপনাকে সফল করতে কাজ করে যাই।
        </p>
        <p>
          ‘রিস্টার্ট ইয়োরসেলফ’ হচ্ছে নিজেকে ভালো রাখার বিশেষ কৌশল। আপনি যেখানে
          যে অবস্থাতেই থাকুন না কেন সেখান থেকে আপনাকে উচ্চতর লক্ষ্যের প্রতি ঠেলে
          দেয়াই ‘রিস্টর্ট ইয়োরসেলফ’ এর মূল কাজ। আমরা বিশ্বাস করি, প্রতিটি জীবন
          অমূল্য এবং সৃষ্টিকর্তা কিছু বিশেষ উদ্দেশ্য নিয়ে আমাদেরকে এই
          মহামূল্যবান উপহারটি দিয়েছেন। সেই বিশেষ উদ্দেশ্য খুঁজে পাওয়া কিংবা
          সেটির দিকে আপনাকে আরেক ধাপ এগিয়ে দেয়াই ‘রিস্টর্ট ইয়োরসেলফ’-এর লক্ষ্য।
          এক কথায় এটিকে আমরা বলি – পিপল ট্রান্সফর্মেশন।
        </p>
        <p>
          প্রাচ্য ও পাশ্চাত্যের দর্শন এবং বিভিন্ন সময়ে পৃথিবীকে বদলে দেয়া
          নেতৃত্বের ধারণাগুলো থেকে অনুপ্রাণিত হয়ে ‘রিস্টার্ট ইয়োরসেলফ’ এর নলেজ,
          টুলস ও টেকনিকগুলো তৈরি করা হয়েছে। এখানে একদিকে রয়েছে বুদ্ধের জীবন বোধ,
          ইওগিক কৌশল, বিভিন্ন ধর্মীয় দর্শনের উপজীব্য ইত্যাদি, অন্যদিকে আছে
          ভিক্টর ফ্রাঙ্কলের দর্শন কিংবা স্টিফেন কোভে, টনি রবিনস ও রবিন শর্মার
          আধুনিক নেতৃত্বের মূলপাঠ। আছে মিহাই চিক্সেন্টমিহাই এর মতো আধুনিক
          সাইকোলজিস্ট এর গবেষণা ফলাফল এবং একহাট টোল এর মতো বিশ্বনন্দিত
          স্পিরিচুয়াল গুরুর শিক্ষা। পাশাপশি নেয়া হয়েছে পজিটিভ সাইকোলজি, নিউরোলজি
          ও নিউরাল নেটওয়ার্কস এর সর্বশেষ জ্ঞান।
        </p>
        <p>
          ‘রিস্টর্ট ইয়োরসেলফ’ আপনাকে নিজের ও চারিদিকের অন্য সবকিছু সম্পর্কে
          আপনার দৃষ্টিভঙ্গির পরিবর্তন করে আপনাকে সেলফ এক্সপ্লোরেশন ও সেলফ
          ট্রান্সফর্মেশন এর অপূর্ব সুযোগ তৈরি করে দেবে। আপনি নিজেই হয়ে উঠবেন
          আত্মউন্নয়ন ও ক্রমিক সমৃদ্ধির পথে পজিটিভ এনার্জির মূল উৎস।
        </p>
        <p>
          তাই ‘রিস্টার্ট ইয়োরসেলফ’ হচ্ছে সুখী, সমৃদ্ধ ও অর্থবহ জীবন তৈরির
          হাতিয়ার।
        </p>
      </div>
    </div>
  );
};

export default WhyTrust;
